ajaxTwitter/app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Your mom "], ["created_at", "2016-11-09 20:58:27.547335"], ["updated_at", "2016-11-09 20:58:27.547335"], ["user_id", 8]]
---
  def create
    # simulate latency
    sleep(1)

    @tweet = current_user.tweets.build(tweet_params)

    if @tweet.save